**** Quantitave analyse
      #+BEGIN_SRC python :results raw :session plop
import glob

import matplotlib.pyplot as plt
import pandas as pd
from tabulate import tabulate


# Assuming everything is under the result dir...
ls = glob.iglob("result/*.csv")
df = pd.read_csv(next(ls))
for f in ls:
    df = pd.concat([df, pd.read_csv(f)])

# Number of tracks
table = [
    ["Number of tracks", len(df)],
    ["Number of abnormal tracks", len(df[df.normality == 'abnormal'])],
    ["Faulty tracks", len(df[df.status == 1])]
]
tabulate(table, headers=["", "count"], tablefmt="orgtbl")
      #+END_SRC

      #+RESULTS:
      |                           |  count |
      |---------------------------+--------|
      | Number of tracks          | 227863 |
      | Number of abnormal tracks |   5680 |
      | Faulty tracks             | 140820 |


      #+BEGIN_SRC python :results raw :session plop
# let's account only for non faulty tracks
# those which aren't been filtered out by processAIS
df_ok = df[df.status == 0] # NoneType err
tabulate(df_ok.loc[:, ["duration", "length"]].describe(), headers="keys", tablefmt="orgtbl")
      #+END_SRC

      #+RESULTS:
      |       | duration |  length |
      |-------+----------+---------|
      | count |    87043 |   87043 |
      | mean  |  2.08575 | 766.335 |
      | std   | 0.380716 | 2933.63 |
      | min   |  1.49174 |      20 |
      | 25%   |  1.80611 |     177 |
      | 50%   |  2.00386 |     359 |
      | 75%   |  2.24309 |     693 |
      | max   |  4.44137 |  184408 |

Reading: In average the alert function was able to handle approx one track every
2.08575s . In other words, a single instance of the ~stream~ operator should be
able to handle 0.5 track per second. Note that these results are CPU freq
dependent. The observed variations weren't significant between different CPU
velocity.



***** Break down per month of normal/abnormal tracks.

          #+BEGIN_SRC python :results raw :session plop
    # Adding some columns (year and month)
    import datetime
    df["year_start"] = df.start.map(lambda x: datetime.datetime.fromtimestamp(x).year)
    df["month_start"] = df.start.map(lambda x: datetime.datetime.fromtimestamp(x).month)
    df_count_by_month = df[df.status == 0 ].groupby(["year_start","month_start", "normality"])["track"].count()
    tabulate(df_count_by_month.unstack(), headers="keys", tablefmt="orgtbl")
          #+END_SRC
      
          #+RESULTS:
          |            | abnormal | normal |
          |------------+----------+--------|
          | (2011, 7)  |       53 |   1280 |
          | (2011, 8)  |       37 |   1301 |
          | (2011, 9)  |       25 |   1091 |
          | (2011, 10) |      100 |    992 |
          | (2011, 11) |        6 |    639 |
          | (2011, 12) |       27 |    500 |
          | (2012, 1)  |       21 |    608 |
          | (2012, 2)  |       13 |    504 |
          | (2012, 3)  |       29 |    847 |
          | (2012, 4)  |        5 |    375 |
          | (2012, 5)  |       22 |    494 |
          | (2012, 6)  |        9 |    314 |
          | (2012, 7)  |       25 |    293 |
          | (2012, 8)  |       20 |    300 |
          | (2012, 9)  |       10 |    400 |
          | (2012, 10) |        5 |    182 |
          | (2012, 11) |        1 |    148 |
          | (2012, 12) |       18 |    202 |
          | (2013, 1)  |       41 |    992 |
          | (2013, 2)  |       16 |    581 |
          | (2013, 3)  |       10 |    600 |
          | (2013, 4)  |       17 |    514 |
          | (2013, 5)  |       98 |   1361 |
          | (2013, 6)  |       29 |    725 |
          | (2013, 7)  |       74 |    928 |
          | (2013, 8)  |       33 |    591 |
          | (2013, 9)  |       49 |    565 |
          | (2013, 10) |       22 |    462 |
          | (2013, 11) |        7 |    318 |
          | (2013, 12) |       29 |    387 |
          | (2014, 1)  |       26 |    910 |
          | (2014, 2)  |       40 |    671 |
          | (2014, 3)  |       33 |   1205 |
          | (2014, 4)  |       38 |   1348 |
          | (2014, 5)  |      104 |   2267 |
          | (2014, 6)  |      119 |   1673 |
          | (2014, 7)  |       82 |    994 |
          | (2014, 8)  |       59 |   1171 |
          | (2014, 9)  |      171 |   1611 |
          | (2014, 10) |       36 |   1471 |
          | (2014, 11) |       83 |   1068 |
          | (2014, 12) |       60 |   1172 |
          | (2015, 1)  |       59 |   1635 |
          | (2015, 2)  |       51 |    971 |
          | (2015, 3)  |      129 |   1515 |
          | (2015, 4)  |       23 |    908 |
          | (2015, 5)  |      146 |   1371 |
          | (2015, 6)  |       68 |   1184 |
          | (2015, 7)  |       61 |    709 |
          | (2015, 8)  |       61 |    549 |
          | (2015, 9)  |       52 |    864 |
          | (2015, 10) |       32 |    573 |
          | (2015, 11) |       60 |    749 |
          | (2015, 12) |       41 |    757 |
          | (2016, 1)  |       53 |   1191 |
          | (2016, 2)  |       29 |    807 |
          | (2016, 3)  |       39 |    951 |
          | (2016, 4)  |       11 |    306 |
          | (2016, 5)  |      106 |   1394 |
          | (2016, 6)  |      195 |   1563 |
          | (2016, 7)  |      279 |   1292 |
          | (2016, 8)  |      211 |   1216 |
          | (2016, 9)  |      190 |   1373 |
          | (2016, 10) |      110 |   1817 |
          | (2016, 11) |       91 |   1253 |
          | (2016, 12) |       99 |   1830 |
          | (2017, 1)  |       41 |   2509 |
          | (2017, 2)  |       18 |   1479 |
          | (2017, 3)  |      132 |   2867 |
          | (2017, 4)  |       80 |   1381 |
          | (2017, 5)  |      213 |   2409 |
          | (2017, 6)  |      380 |   2092 |
          | (2017, 7)  |      186 |   1080 |
          | (2017, 8)  |      325 |   1388 |
          | (2017, 9)  |      123 |   1027 |
          | (2017, 10) |       80 |    876 |
          | (2017, 11) |       30 |    827 |
          | (2017, 12) |       86 |   1180 |
          | (2018, 1)  |       88 |   1415 |

